Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: དེ་བས་ཤཱ་རིའི་བུས་འོག་ནས་ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཡོངས་སུ་བཟུང་བ་རྣམས་ནི་ཞེས་བྱ་བ་ལ་སོགས་པས་དེ་གཙོ་བོ་ཡིན་པར་བསྟན་ཏེ།
en: So then Śāriputra says “assisted by the perfection of wisdom” and so on. It teaches that this perfection of wisdom is principal.

source: དེ་ལས་གཞན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུར་གྱུར་པ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དབང་གིས་གྱུར་ཏེ། དེ་བས་ན་འདི་ལ་རབ་ཏུ་གུས་པར་བྱའོ་ཞེས་བསྟན་པའོ།
en: It teaches that even though all the perfections other than that are causes of unsurpassed, perfect, complete awakening, they are governed by it, so it should be greatly respected. “

source: །དེ་དག་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བས་ན་ཞེས་བྱ་བ་ནི་རྗེས་སུ་ཡི་རང་བས་སོ།
en: Dedicate” them all “to the knowledge of all aspects” by rejoicing in them. “

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྔ་རྣམས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཡོངས་སུ་བཟུང་ན། ཕ་རོལ་ཏུ་ཕྱིན་པའི་མིང་མི་འཐོབ་པོ་ཞེས་བྱ་བ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་གཅིག་ལ་གཅིག་གནས་ཤིང་གཅིག་གི་རྒྱུ་གཅིག་ཡིན་པར་སྔར་བསྟན་པའི་ཕྱིར་སྨོས་སོ།
en: When the five perfections are assisted by the perfection of giving, they do not get the name perfection.” It says this because it taught earlier that all six are lodged one in the other and work as a single cause. “

source: །དེ་ནི་དེ་ལྟར་མ་ཡིན་ཏེ་ཀཽ་ཤི་ཀ་དེ་ནི་དེ་ལྟར་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་དག་ལས་གཅིག་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་ཚེ་ཡང་དྲུག་ཅར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བས། ཕན་ཚུན་གཅིག་གི་རྒྱུར་གཅིག་འགྱུར་བ་ཙམ་དུ་ཟད་ཀྱི། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལྟར་ཐམས་ཅད་ཀྱི་བདག་ཉིད་ཀྱིས་རྣམ་པ་ཐམས་ཅད་དུ་རྒྱུར་འགྱུར་བ་ནི་མ་ཡིན་པར་སྟོན་ཏོ།
en: It is not so, Kauśika, it is not so” is teaching that when you complete one of the six perfections, all six are completed, so they are reciprocally one and just simply one cause, but, unlike the perfection of wisdom that is the nature of them all, they are not therefore the cause in all respects. “

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཇི་ལྟར་མངོན་པར་བསྒྲུབ་པར་བགྱི་ཞེས་བྱ་བ་འདིར་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པའི་རྣམ་པ་དྲིས་པ་ནི་མ་ཡིན་གྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པའི་འབྲས་བུ་དྲིས་པའོ།
en: Lord, how should [they]… find and produce within themselves the perfection of wisdom?” Here too it is not asking how they find and produce the perfection of wisdom within themselves, it is asking what the result of finding and producing the perfection of wisdom within themselves is. “

source: །གཟུགས་མངོན་པར་བསྒྲུབ་པ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་གཟུགས་དངོས་པོ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: So they do not find and produce within themselves form” means: so form is a nonexistent thing. “

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་གཟུགས་མངོན་པར་བསྒྲུབ་པ་མ་མཆིས་པའི་སླད་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བགྱི་ཞེས་བྱ་བ་ནི་ཞུས་པ་གཉིས་པ་སྟེ།
en: Lord, how do they find and produce within themselves the perfection of wisdom so that they do not find and produce within themselves form?” This is the second question Śāriputra asks the Lord.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པ་གང་གིས་མངོན་པར་བསྒྲུབ་པ་ན་གཟུགས་ལ་སོགས་པ་མེད་པར་རིགས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: It means: in what form within themselves should the perfection of wisdom be found and produced so that the nonexistence of form and so on is feasible? “

source: །ཤཱ་རིའི་བུ་གཟུགས་མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་འབྱུང་བ་མེད་པ་དང་། འཇིག་པ་མེད་པ་དང་། དམིགས་པ་མེད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་གྲུབ་པའི་གནས་སྐབས་ན་ཀུན་བརྟགས་པའི་གཟུགས་མངོན་པར་འདུ་བྱེད་པ་མེད་དོ།
en: Śāriputra, they should find and produce within themselves the perfection of wisdom as the nonenactment, the nonproduction, the noncessation, the nonappearance, the nondestruction, and the nonapprehension of form.”

source: །སྐྱེ་བ་དང་།
en: In the context of a thoroughly established phenomenon there is no “enactment” of falsely imagined form.

source: འགག་པ་གཉིས་ཀྱང་རྒྱུན་གྱི་དབང་གིས་མེད་དོ།
en: There is neither “production nor cessation” from the perspective of a continuum.

source: །སྐད་ཅིག་རེ་རེ་ལ་ཡང་འབྱུང་བ་དང་འཇིག་པ་གཉིས་མེད་དོ།
en: In each instant there is neither “appearance nor nondestruction.”

source: །རྣམ་པ་ཐམས་ཅད་སྐྱེ་བ་མེད་པས་དམིགས་པ་མེད་དོ་ཞེས་སེམས་ཤིང་ཡིད་ལ་བྱེད་པ་དེས་གང་གི་ཚེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྒོམ་པ་དེའི་ཚེ་ཆོས་གང་ཡང་ཐོབ་པར་མི་བྱེད་ཅེས་བྱ་སྟེ།
en: And there is no “apprehension” because in all respects there is no production. It “does not cause any dharma to be gained.”

source: དེའི་ཚེ་ནི་ཆོས་གང་ཡང་མེད་དོ།
en: At that time there are not any dharmas at all. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གྲངས་སུ་འགྲོའོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་དངོས་པོ་མེད་པའི་ཕ་རོལ་ཏུ་སོན་པ་རྣམ་པར་མི་རྟོག་པ་རྩོལ་བ་མེད་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ།
en: It is counted as the perfection of wisdom.” The nonconceptual effortless wisdom that has gone to the other side of the nonexistence of all dharmas is the “perfection of wisdom.” “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་ཐོབ་པར་མི་བྱེད།
en: The perfection of wisdom… does not cause even the knowledge of all aspects to be gained.

source: དམིགས་པར་མི་བྱེད་དོ་ཞེས་བྱ་བ་ནི་ཆོས་ཀྱི་སྐུའི་གནས་སྐབས་ན་དེ་ཉིད་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཅེས་བྱ་སྟེ།
en: It does not apprehend it.” In the context of the dharma body, just that is the perfection of wisdom, just that is the knowledge of all aspects.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་གཞན་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་གཞན་ཞེས་བྱ་བ་མི་དམིགས་སོ།
en: It does not apprehend that “the knowledge of all aspects is one thing and the perfection of wisdom another.” “

source: །ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་མིང་ཇི་ལྟ་བ་དང་མཚན་མ་ཇི་ལྟ་བ་དང་།
en: Kauśika… it is because the perfection of wisdom does not cause it to be gained as a name, as a causal sign, or as something to be enacted.”

source: མངོན་པར་འདུ་བྱེད་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཐོབ་པར་མི་བྱེད་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་ཆོས་ཉིད་རྣམ་པར་མི་རྟོག་པ་སྟེ།
en: The true nature of dharmas is nonconceptual.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཆོས་གང་ཡང་མིང་དང་མཚན་མ་དང་མངོན་པར་འདུ་བྱེད་པས་མི་འཛིན་ཏོ། །དེ་བས་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་མིང་དེ་ཡང་མཚན་མ་དེ་དང་། མངོན་པར་འདུ་བྱེད་པ་དེས་དམིགས་སུ་མེད་དོ།
en: The perfection of wisdom does not grasp any dharma at all through a name, causal sign, or enactment, so the knowledge of all aspects cannot be apprehended through that name, that causal sign, or that enactment. “

source: །བཅོམ་ལྡན་འདས་འོ་ན་ཇི་ལྟར་ཐོབ་པར་བགྱིད་པ་ལགས་ཞེས་བྱ་བ་ནི།
en: Well then, Lord, how does this perfection of wisdom cause it to be gained?”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་དོ་ཞེས་བྱ་བ་ཀུན་རྫོབ་ཏུ་ཡོད་པས་ཇི་ལྟར་ཐོབ་པར་བྱེད་ཅེས་ཞུས་པའོ།
en: Insofar as the perfection of wisdom does cause the knowledge of all aspects to be gained conventionally, how does it cause it to be gained? “

source: །ཅི་ནས་ཀྱང་མི་དམིགས་པ་དང་མི་ལེན་པ་དང་མི་གནས་པ་དང་མི་འདོར་བ་དང་མངོན་པར་ཞེན་པ་མེད་པ་དང་། མི་འཛིན་པ་དང་། མི་གཏོང་བ་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་པ་མེད་དེ་ཆོས་གང་ཡང་ཐོབ་པར་བྱེད་པ་མེད་དོ་ཞེས་བྱ་བ་ནི་གང་གི་ཚེ་ཤེས་རབ་འདི་དམིགས་པར་བྱ་བ་དང་།
en: The perfection of wisdom causes it to be gained without apprehending, without asserting, without being stationed on, without forsaking, without settling down on, without grasping, and without rejecting anything at all, but it does not cause any dharma to be gained.”

source: དམིགས་པར་བྱེད་པའི་དངོས་པོ་མཉམ་པས་མཉམ་པར་གྱུར་པ་ན་ཆོས་གང་ཡང་བདག་གིས་གཟུང་བར་བྱ་བར་མི་དམིགས་པ་དང་། བདག་རང་འཛིན་པ་པོའི་བདག་ཉིད་དུ་མི་ལེན་པ་དང་། མིག་ལ་སོགས་པ་ལྟར་གནས་ཀྱི་དངོས་པོར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དང་། ཉོན་མོངས་པའི་རྣམ་པར་རྟོག་པ་དོར་བར་བྱ་བ་གང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དང་། འདི་ནི་བདེན་པའོ་ཞེས་བདེན་པའི་བདག་ཉིད་དུ་ཡང་ཅུང་ཟད་ཀྱང་མངོན་པར་ཞེན་པ་མེད་པ་དང་།
en: When apprehended and apprehender have become the same thing in the same form, this wisdom does not “apprehend” that this is a dharma I have to grasp; does not “assert” that I myself am the grasper; does not see, as does the eye and so on, as something “stationed”; does not see any defiling conceptualization that has to be “forsaken”; does not “settle down” even slightly on “this is true” as being in the nature of truth; and does not “grasp or reject” because it does not see what is grasped and has to be joined with in the form of bright and dark sides.

source: གཟུང་བ་དང་སྦྱར་བར་བྱ་བ་དཀར་པོ་དང་ནག་པོའི་ཕྱོགས་སུ་གྱུར་པ་ཡང་མ་མཐོང་བས་མི་འཛིན་མི་གཏོང་བ་དེའི་ཚེ་བདག་ཉིད་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ངོ་བོར་གནས་པའི་ཕྱིར། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་ཅེས་ཀྱང་བཤད། གང་ཡང་ཐོབ་པར་མི་བྱེད་ཅེས་ཀྱང་བཤད་དོ།
en: At that time, because it itself is the entity of the knowledge of all aspects, it is also said that “it causes the knowledge of all aspects to be gained.” “

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ངོ་མཚར་ཆེའོ་ཞེས་བྱ་བ་ནི་དེའི་ཆོས་ཐམས་ཅད་མེད་པས་མི་སྐྱེ་བ་དང་། མི་འགག་པ་དང་། མངོན་པར་འདུ་མི་བྱེད་པ་དང་། མི་དམིགས་པ་དང་། འཇིག་པར་མི་འགྱུར་བའི་ཕྱིར་གནས་སྐབས་དེ་ན་མི་སྐྱེ་བ་ལ་སོགས་པའི་མིང་གིས་བརྗོད་དོ།
en: It is amazing, Lord, … this perfection of wisdom…” Because all dharmas do not exist, they are not produced, do not cease, do not occasion anything, are not apprehended, and are not destroyed in that context, it is explained with the names “nonproduction” and so on.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཆོས་ཐམས་ཅད་ཐོབ་པར་བགྱིད་པའོ། །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཆོས་ཐམས་ཅད་ཐོབ་པར་མི་བགྱིད་པའོ་ཞེས་དེ་ལྟ་བུའི་འདུ་ཤེས་སུ་གྱུར་ན་ཞེས་བྱ་བ་ནི་དངོས་པོ་དང་། དངོས་པོ་མེད་པ་གཉི་གར་རྣམ་པར་རྟོག་པའི་ཕྱིར་དེ་སྐད་བཤད་དོ།
en: It says if they “have such ideas as ‘the perfection of wisdom causes all dharmas to be gained’ or ‘the perfection of wisdom does not cause all dharmas to be gained,’… the perfection of wisdom is forsaken,” because both an existent thing and a nonexistent thing are thought constructions. “

source: །གཟུགས་ལ་ཡིད་ཆེས་པར་མི་འགྱུར་རོ་ཞེས་བྱ་བ་ནི་གཟུགས་དངོས་པོ་མེད་པའི་མཚན་ཉིད་དུ་ཡིད་ཆེས་ཤིང་ཁོང་དུ་ཆུད་པར་གྱུར་ཏོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: I do not have confidence in form.” This means the Lord has confidence in and comprehends form that is marked as a nonexistent thing.

source: །དེ་བཞིན་དུ་གཞན་དག་ལ་ཡང་སྦྱར་རོ།
en: Construe the others similarly. “

source: །རབ་འབྱོར་གཟུགས་མི་དམིགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡིད་ཆེས་པར་འགྱུར་ཞེས་བྱ་བ་ལ་སོགས་པ་ནི་གཟུགས་ལ་སོགས་པའི་ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དུ་ཁོང་དུ་ཆུད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཡིད་ཆེས་ཏེ། མངོན་སུམ་དུ་བྱས་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Subhūti, the perfection of wisdom gives me confidence because form cannot be apprehended,” and so on, means that having comprehended all dharmas, form and so on, as the nonexistence of an intrinsic nature, the Lord has “confidence in”—that is, has a directly realization of—the perfection of wisdom. “

source: །གཟུགས་ཆེ་བར་མི་བགྱིད་ཆུང་བར་མི་བགྱིད་ཅེས་བྱ་བ་ན་ཡོངས་སུ་གྲུབ་པའི་ཆོས་ཉིད་ཀྱི་གཟུགས་ཆེ་བར་མི་བྱེད་ལ། ཀུན་བརྟགས་པའི་གཟུགས་ཀྱང་ཆུང་བར་ཡང་མི་བྱེད་པའོ།
en: Does not make form bigger nor does not make it smaller”— it does not make the form of the true nature of dharmas that is thoroughly established bigger and it does not make falsely imagined form smaller.

source: །དེ་བཞིན་དུ་ཐམས་ཅད་ལ་སྦྱར་བར་བྱའོ།
en: Construe them all similarly. “

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་འདུ་ཤེས་སུ་གྱུར་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་མ་ལགས་སོ་ཞེས་བྱ་བ་ནི་གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འགའ་ཞིག་བྱེད་ན་ནི་དེ་ལྟར་གྱུར་ན།
en: Those bodhisattva great beings with such notions, Lord, are not practicing the the perfection of wisdom.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་མི་བྱེད་དོ་ཞེས་དེ་སྐད་བརྗོད་དུ་རུང་ན།
en: Were this perfection of wisdom to do anything, in that case it might be right to say ‘this perfection of wisdom does not do anything,’ but because this perfection of wisdom is beyond every false imagination it does not do anything at all.

source: གང་གི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་ལས་འདས་ཏེ་ཅི་ཡང་མི་བྱེད་པས་དེའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གཟུགས་ཆེ་བར་མི་བྱེད་ཆུང་བར་མི་བྱེད་ཅེས་བྱ་བ་ལ་སོགས་པ་འདི་དག་བརྗོད་པར་མི་རིགས་སོ།
en: Therefore it is not right to say that “the perfection of wisdom does not make form bigger and does not make form smaller” and so on. “

source: །བཅོམ་ལྡན་འདས་འདི་ལྟར་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུ་མཐུན་པ་མ་ལགས་སོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་ཀྱིས་རང་གི་ངོ་བོ་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ་གནས་པས་དེ་ལ་གང་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྒྱུ་མཐུན་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Lord… because… they are not in harmony with the perfection of wisdom as cause” means that because all dharmas remain in their intrinsic nature, in their own basic nature as it really is, there is nothing there in harmony with the perfection of wisdom as cause.

source: །ད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་གཟུགས་ལ་སོགས་པ་བཞིན་དུ་རྣམ་གྲངས་བཅུ་གཉིས་ཀྱིས་བསྟན་ཏེ།
en: Now it again teaches that even the perfection of wisdom is like form and so on, in twelve rounds of teaching beginning with “because beings are not produced.”

source: སེམས་ཅན་སྐྱེ་བ་མ་མཆིས་པའི་སླད་དུ་ཞེས་བྱ་བ་ནི་སེམས་ཅན་སྐྱེ་བ་མེད་པའི་མཚན་ཉིད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་མཚན་ཉིད་མེད་པར་བལྟ་བར་བྱའོ།
en: You should view the perfection of wisdom as marked by nonproduction because a being is marked by not arising.

source: །དེ་ལ་སེམས་ཅན་སྐྱེ་བ་མ་མཆིས་པའི་སླད་དུ་ཞེས་བྱ་བ་ནས། མཐོང་བ་པོ་སྐྱེ་བ་མ་མཆིས་པའི་སླད་དུ་ཞེས་བྱ་བའི་བར་དུ་ནི་གང་ཟག་ལ་བདག་མེད་པ་ལ་དགོངས་པའོ།
en: There, “because beings are not produced,” up to “because one who sees is not produced,” intends the selflessness of persons.

source: །གཟུགས་སྐྱེ་བ་མ་མཆིས་པའི་སླད་དུ་ཞེས་བྱ་བ་ནས་སངས་རྒྱས་ཀྱི་ཆོས་སྐྱེ་བ་མ་མཆིས་པའི་སླད་དུ་ཞེས་བྱ་བའི་བར་དུ་ནི་ཆོས་ལ་བདག་མེད་པ་ལ་དགོངས་པའོ།
en: From “because form is not produced, up to… because a buddha is not produced,” intends the selflessness of dharmas. “There is no full awakening” of form and so on.

source: །མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་མ་མཆིས་པ་ནི་རྟོགས་པ་མེད་པའོ།
en: There is no realization of them. “

source: །སེམས་ཅན་སྟོབས་དང་མི་ལྡན་པའི་སླད་དུ་ཞེས་བྱ་བ་ནི་ཉམ་ཆུང་བའམ་ཤེས་རབ་ཀྱི་སྟོབས་མེད་པའོ།
en: Because beings are not endowed with the powers,” they are weak or do not have the power of wisdom.

source: །ཆོས་བླུན་པ་ཉིད་ཀྱི་ཕྱིར་རོ་ཞེས་བྱ་བ་ནི་ཆོས་རྣམས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Not bound and not freed “Because dharmas are in an inanimate material state” means because all dharmas are the nonexistence of an intrinsic nature.

source: །དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་བདག་ཉིད་ཆེ་ཞིང་རྒྱ་ཆེ་བ་ཐོས་ནས་གནས་བརྟན་ཤཱ་རིའི་བུ་དད་པ་སྐྱེས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕྱིར་ཞུ་བ་རྣམ་པ་བཞི་བརྩམས་པ། བྱང་ཆུབ་སེམས་དཔའི་འཆི་འཕོ་དང་སྐྱེ་བ་དང་། ཡང་དག་པར་ཞུགས་པའི་དུས་ཀྱི་ཚད་དང་། བསྙེན་བཀུར་བྱས་པའི་དེ་བཞིན་གཤེགས་པའི་ཚད་དང་།
en: The elder Śāriputra, having heard that this perfection is thus in its nature big and vast, feels faith, and for the bodhisattvas poses four questions about the death and birth of bodhisattvas, the amount of time since they have set out, the number of tathāgatas they have attended on, and the amount of time they have been practitioners of the perfections.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་སྤྱད་པའི་དུས་ཀྱི་ཚད་དོ། །སྐབས་དེ་ཉིད་དུ་དམ་པའི་ཆོས་སྤོང་བའི་གཏམ་གྱི་སྐབས་དབྱེའོ། །དེ་ནས་ཡང་སྐབས་དེ་ཉིད་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མོས་པར་དཀའ་བའི་སྐབས་ཕྱེའོ།
en: That same part of the text sets the scene for an account of what happens to those forsaking the good Dharma, and that same part of the text also sets the scene for it being “hard… to believe in this perfection of wisdom.”

source: །དེ་ནས་ཡང་མོས་པར་དཀའ་བ་དེ་བསྟན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་གང་དེ་ལྟར་མོས་པར་དཀའ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ཇི་ཙམ་དུ་ཟབ་པ་ལགས་ཞེས་བྱ་བས་ཟབ་པའི་ཞུ་བ་ཞུས་ནས།
en: Then, because it has taught it is hard to believe in, Subhūti asks the question, “Just how deep, Lord, is this perfection of wisdom in which it is so hard for them to believe?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་མ་བཅིངས་མ་གྲོལ་བར་བཤད་པ་དང་། རྣམ་པར་དག་པ་བཤད་པ་དང་། ཀུན་དུ་མཐའ་ཡས་པ་བཤད་པ་དང་། ཆགས་པ་དང་མ་ཆགས་པ་བཤད་པ་སྟེ།
en: The Lord explains that it “is not bound and it is not freed,” explains about “purity,” explains about “the unlimited,” and explains about “those who are attached and not attached.”

source: བཤད་པ་རྣམ་པ་བཞིའི་སྐབས་ཕྱེའོ།
en: Thus, it sets the scene for a fourfold explanation.

source: །དེ་ལ་རབ་འབྱོར་གཟུགས་མ་བཅིངས་མ་གྲོལ་ཞེས་བྱ་བ་ནི་རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གནས་སྐབས་གང་ཡོངས་སུ་གྲུབ་པའི་ཆོས་ཉིད་ཀྱི་གཟུགས་སུ་སྣང་བ་དེ་འཁོར་བའི་གནས་སྐབས་ན།
en: Among these, “Subhūti… form is not bound and it is not freed.”

source: དུས་དེ་སྲིད་དུ་ལས་དང་ཉོན་མོངས་པ་དང་། རྣམ་པར་སྨིན་པའི་བཅིང་བ་ཐམས་ཅད་ཀྱིས་མ་བཅིངས་པས་མ་བཅིངས་ཞེས་བྱའོ། །ཕྱིས་ཀྱང་ཡོངས་སུ་གྲུབ་པའི་གནས་སྐབས་ན་གྲོལ་བ་མེད་པའི་ཕྱིར་མ་གྲོལ་བ་ཞེས་བྱའོ། །ཀུན་བརྟགས་པ་ཉིད་ལ་ནི་བཅིངས་པ་དང་གྲོལ་བ་ཞེས་བརྗོད་ཀྱི་ནམ་མཁའ་བཞིན་དུ་ཅིས་ཀྱང་མ་གོས་པ་འགྱུར་བ་མེད་པའི་ཆོས་ཉིད་ཀྱི་གཟུགས་ལ་ནི་མ་ཡིན་ནོ།
en: During the period of the cycle of existences, that which is the appearance of the thoroughly established true dharmic nature of form “is not bound,” because, for the entire duration it is not bound by all the bonds of affliction, karma, and maturation, and later during the period of the thoroughly established phenomenon it “is not freed” because freedom does not exist, so being “bound and freed” is said of just a falsely imagined state, not of the true dharmic nature of form that, like space, is not tainted by anything at all.

source: །དེ་བས་ན་གཟུགས་དངོས་པོ་མེད་པའི་རང་བཞིན་ནི་གཟུགས་སོ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: Therefore, it says “because the nonexistence of an intrinsic nature in form is form.”

source: ཀུན་བརྟགས་པའི་གཟུགས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ནི་ཆོས་ཉིད་ཀྱི་གཟུགས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means falsely imagined form, the nonexistence of an intrinsic nature, is the true dharmic nature of form.

source: །དེ་བཞིན་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་ཆོས་ཐམས་ཅད་ལ་ཡང་སྦྱར་བར་བྱའོ།
en: You should construe all dharmas, up to the knowledge of all aspects, like this as well.

source: །ཡང་མ་བཅིངས་མ་གྲོལ་བ་འདི་ཉིད་གསལ་བར་བྱ་བའི་ཕྱིར་དུས་གསུམ་དང་སྦྱར་ཏེ་བསྟན་པ།
en: Again, to elucidate just that, that it is not bound and is not freed, there is an explanation in tandem with the three time periods: “Subhūti, the prior limit of form is not bound and is not freed.”

source: རབ་འབྱོར་གཟུགས་ཀྱི་སྔོན་གྱི་མཐའ་མ་བཅིངས་མ་གྲོལ་བ་ཞེས་བྱ་བ་ནི་ཆོས་ཉིད་ཀྱི་གཟུགས་འཁོར་བ་ན་དྲི་མ་དང་བཅས་པ་མ་དག་པའི་གནས་སྐབས་ལ་སྔོན་གྱི་མཐའ་ཞེས་བྱའོ།
en: The “prior limit” is the true dharmic nature of form in the cycle of existences during the period when there are stains and impurity.

source: །ད་ལྟར་དག་པ་དང་མ་དག་པའི་གནས་སྐབས་ལ་ད་ལྟར་བྱུང་བ་ཞེས་བྱའོ།
en: The “present” describes the present period during which there is purity and impurity. “

source: །ཕྱིས་དག་པའི་གནས་སྐབས་ལ་ཕྱི་མའི་མཐའ་ཞེས་བྱའོ།
en: The later limit” describes the future period when there is purity. “

source: །སྔོན་གྱི་མཐའ་དངོས་པོ་མེད་པའི་རང་བཞིན་ནི་གཟུགས་སོ་ཞེས་བྱ་བས་ནི་དུས་གསུམ་ཆར་དུ་ཡང་མི་འགྱུར་བར་གནས་པའི་མཚན་ཉིད་ནི་དེ་བཞིན་ཉིད་ཡིན་ནོ་ཞེས་སྟོན་ཏེ། ཆོས་ཉིད་ནི་དུས་ལས་རྣམ་པར་གྲོལ་བའི་མཚན་ཉིད་མ་ཡིན་པར་བསྟན་ཏོ།
en: Because the nonexistence of an intrinsic nature in the prior limit is form” teaches that what is marked as abiding without change in all three time periods is suchness, indicating that the true nature of dharmas does not have the mark of being freed over time.

source: །དེ་ལྟར་མ་བཅིངས་མ་གྲོལ་བར་བཤད་པས་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་དངོས་པོ་མེད་པར་བསྟན་ནས་ཡང་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པར་བསྟན་པའི་ཕྱིར་རྣམ་པར་དག་པ་བཤད་པར་བརྩམས་པ། གཟུགས་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ནི་འབྲས་བུ་རྣམ་པར་དག་པའོ་ཞེས་བྱ་བ་ནི།
en: Purity Having thus taught, through the explanation of not being bound and not being freed, that saṃsāra and nirvāṇa are nonexistent things, again, to teach that defilement and purification do not exist it begins the explanation of purity with “that purity of form is the purity of the result.”

source: དེ་ལ་གཟུགས་ལ་སོགས་པ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མཐར་ཐུག་པའི་ཆོས་རྣམས་ལ་བཅིངས་པ་མེད་པས་ཀུན་ནས་ཉོན་མོངས་པ་མེད་དོ།
en: There the dharmas from form, up to, finally, the knowledge of all aspects, have no bonds so there is no defilement.

source: །ཀུན་ནས་ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་ངོ་བོ་ཉིད་ཀྱིས་རྣམ་པར་དག་པའོ། །ངོ་བོ་ཉིད་ཀྱིས་རྣམ་པར་དག་པའི་ཕྱིར་རྣམ་པར་བྱང་བའི་ཆོས་རྣམས་ཀྱང་མེད་དེ།
en: Because there is no defilement they are pure in their intrinsic nature, and because they are pure in their intrinsic nature there are no purification dharmas either.

source: རང་བཞིན་གྱིས་རྣམ་པར་དག་པ་ལ་ནི་དོན་དམ་པར་རྣམ་པར་བྱང་བའི་ཆོས་རྣམས་ཅི་ཡང་མི་བྱེད་དོ།
en: Ultimately purification dharmas do not do anything at all to natural purity.

source: །དེ་བས་ན་ཀུན་ནས་ཉོན་མོངས་པ་དང་།
en: So, even though defilement and purification are impossible, foolish beings construct them.

source: རྣམ་པར་བྱང་བ་རྣམ་པར་མི་རྟོག་པ་ཡང་བྱིས་པ་རྣམས་ཀྱིས་བརྟགས་པ་ཉིད་དེ་ཡོངས་སུ་གྲུབ་པ་མ་ཡིན་ནོ།
en: They are not thoroughly established.

source: །དེ་ལྟར་རྣམ་པ་གཅིག་གིས་མོས་པར་དཀའ་བ་བསྟན་ནས། ཡང་རྣམ་པར་དག་པའི་ཕྱིར་མོས་པར་དཀའ་བ་བསྟན་པ།
en: Thus, having taught in one way that it is hard to believe, it again teaches it is hard to believe because of purity.

source: དེ་ལ་གཟུགས་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ཉིད་འབྲས་བུ་རྣམ་པར་དག་པའོ་ཞེས་བྱ་བ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ལ་སོགས་པ་རྣམ་པར་བྱང་བའི་ཆོས་རྣམས་ཀྱི་འབྲས་བུར་གྱུར་པ་རྣམ་པར་དག་པ་ཞེས་བྱ་བ་གུད་ན་གང་ཡང་མེད་ཀྱི་གང་ཆོས་ཉིད་ཀྱི་གཟུགས་ཡོངས་སུ་གྲུབ་པ་ངོ་བོ་ཉིད་དུ་གྱུར་པ་རྟག་ཏུ་གནས་པ་རྣམ་པར་དག་པ་དེ་ཉིད་འབྲས་བུར་གྱུར་པའི་རྣམ་པར་དག་པའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: There, “just that purity of form is the purity of the result” means there is nothing other than purity that results from the purification dharmas—the perfections, the dharmas on the side of awakening, and so on. The true dharmic nature of form, the constantly abiding purity in the form of the thoroughly established nature, just that is purity in the form of the result.

source: །དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ལ་ཡང་སྦྱར་བར་བྱའོ།
en: You should construe all the dharmas like this as well.

source: །དེ་ལྟར་རྣམ་པར་དག་པའི་ངོ་བོ་ཉིད་བསྟན་ནས། དེའི་འོག་ཏུ་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་པར་དག་པ་ཡང་གཅིག་པའི་བདག་ཉིད་དེ་ཐ་དད་པ་མ་ཡིན་པར་བསྟན་པ། གཟུགས་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ཉིད་འབྲས་བུ་རྣམ་པར་དག་པའོ།
en: Having thus taught the intrinsic nature of purity, then it teaches that the purity of all dharmas is also one, not broken apart: “That purity of form is the purity of the result.

source: །འབྲས་བུ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པའོ།
en: That purity of the result is the purity of the perfection of wisdom.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་གང་ཡིན་པ་དེ་གཟུགས་རྣམ་པར་དག་པའོ་ཞེས་བྱ་བ་སྟེ།
en: That purity of the perfection of wisdom is the purity of form.”

source: དེ་ལ་གཟུགས་ཀྱི་ཆོས་ཉིད་ཀྱི་གནས་སྐབས་ལ་ནི་གཟུགས་རྣམ་པར་དག་པ་ཞེས་བྱའོ།
en: There, the true dharmic nature of the form state is called “the purity of form.”

source: །མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་ཡང་དག་པའི་གནས་སྐབས་ལ་ནི་འབྲས་བུ་རྣམ་པར་དག་པ་ཞེས་བྱའོ།
en: The very limit of reality called the “nirvāṇa” state is called “the purity of the result.”

source: །ཆོས་ཀྱི་སྐུའི་གནས་སྐབས་ལ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་ཞེས་བྱའོ།
en: The dharma body state is called “the purity of the perfection of wisdom.”

source: །དེ་ལ་གཟུགས་རྣམ་པར་དག་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་འབྲས་བུ་རྣམ་པར་དག་པ་སྟེ། རྣམ་པར་གྲོལ་བའོ། །རྣམ་པར་གྲོལ་བ་གང་ཡིན་པ་དེ་ཉིད་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམ་པར་དག་པ་སྟེ་ཆོས་ཀྱི་སྐུའོ། །ཆོས་ཀྱི་སྐུ་གང་ཡིན་པ་དེ་ཉིད་གཟུགས་རྣམ་པར་དག་པ་སྟེ། དེ་བཞིན་ཉིད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: The meaning there is that the suchness that is the purity of form is the purity of the result, that is, is freed; just that freedom is the purity of the perfection of wisdom, that is, is the dharma body; and just that dharma body is the purity of form, that is, is suchness.

source: །དེ་བས་ན་དེ་བཞིན་ཉིད་དང་། རྣམ་པར་གྲོལ་བ་དང་ཆོས་ཀྱི་སྐུ་ནི་དོན་དམ་པར་ཐ་དད་པ་མེད་དེ་གཅིག་གོ།
en: Hence suchness, freedom, and the dharma body are ultimately not broken apart.
